This file is a merged representation of the entire codebase, combined into a single document by Repomix.

<file_summary>
This section contains a summary of this file.

<purpose>
This file contains a packed representation of the entire repository's contents.
It is designed to be easily consumable by AI systems for analysis, code review,
or other automated processes.
</purpose>

<file_format>
The content is organized as follows:
1. This summary section
2. Repository information
3. Directory structure
4. Repository files (if enabled)
5. Multiple file entries, each consisting of:
  - File path as an attribute
  - Full contents of the file
</file_format>

<usage_guidelines>
- This file should be treated as read-only. Any changes should be made to the
  original repository files, not this packed version.
- When processing this file, use the file path to distinguish
  between different files in the repository.
- Be aware that this file may contain sensitive information. Handle it with
  the same level of security as you would the original repository.
</usage_guidelines>

<notes>
- Some files may have been excluded based on .gitignore rules and Repomix's configuration
- Binary files are not included in this packed representation. Please refer to the Repository Structure section for a complete list of file paths, including binary files
- Files matching patterns in .gitignore are excluded
- Files matching default ignore patterns are excluded
- Files are sorted by Git change count (files with more changes are at the bottom)
</notes>

</file_summary>

<directory_structure>
asl_static_model/
  group1-shard1of1.bin
  labels.json
  model.json
assets/
  images/
    .gitkeep
  signs/
    alphabet/
      .gitkeep
    phrases/
      .gitkeep
    words/
      .gitkeep
css/
  styles.css
data/
  dashboardData.js
  firestore-rules.txt
js/
  auth/
    firebase.js
  camera/
    cameraUtils.js
  engine/
    classifier.js
    dictionary.js
  lessons/
    curriculum.js
    lessonData.js
  tracking/
    mediapipe.js
  ui/
    dashboard.js
    feedback.js
    renderer.js
  app.js
  m2-capture.js
.gitignore
dashboard.html
index.html
lesson.html
m2-capture.html
m2-test.html
</directory_structure>

<files>
This section contains the contents of the repository's files.

<file path="asl_static_model/labels.json">
{
  "0": "A",
  "1": "B",
  "2": "C",
  "3": "D",
  "4": "E",
  "5": "F",
  "6": "G",
  "7": "H",
  "8": "I",
  "9": "ILY",
  "10": "K",
  "11": "L",
  "12": "M",
  "13": "N",
  "14": "O",
  "15": "P",
  "16": "Q",
  "17": "R",
  "18": "S",
  "19": "T",
  "20": "U",
  "21": "V",
  "22": "W",
  "23": "X",
  "24": "Y"
}
</file>

<file path="asl_static_model/model.json">
{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.13.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "asl_static_model", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 63], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer", "optional": false}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 25, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}}], "build_input_shape": [null, 63]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 1.5625000742147677e-05, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "asl_static_model/batch_normalization/gamma", "shape": [256], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization/beta", "shape": [256], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "asl_static_model/batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "asl_static_model/dense/kernel", "shape": [63, 256], "dtype": "float32"}, {"name": "asl_static_model/dense/bias", "shape": [256], "dtype": "float32"}, {"name": "asl_static_model/dense_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "asl_static_model/dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "asl_static_model/dense_2/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "asl_static_model/dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "asl_static_model/dense_3/kernel", "shape": [64, 25], "dtype": "float32"}, {"name": "asl_static_model/dense_3/bias", "shape": [25], "dtype": "float32"}]}]}
</file>

<file path="js/m2-capture.js">
/**
 * m2-capture.js — Static & Motion Training Data Collection
 * Member 2 [Manlangit] | Branch: [Manlangit]cameratracking-engine
 *
 * Used exclusively by m2-capture.html
 * Handles: webcam init, MediaPipe, static captures, motion sequence recording
 * Does NOT load the classifier model (not needed for data collection)
 */

import { HandLandmarker, FilesetResolver }
  from 'https://cdn.jsdelivr.net/npm/@mediapipe/tasks-vision@0.10.3/+esm';

// ══════════════════════════════════════════════════════════
// CONFIGURATION
// ══════════════════════════════════════════════════════════

const STATIC_SIGNS = [
  'A','B','C','D','E','F','G','H','I','K',
  'L','M','N','O','P','Q','R','S','T','U',
  'V','W','X','Y','ILY'
];
const STATIC_TARGET = 150;

const MOTION_SIGNS = [
  'J','Z',
  'HELLO','THANK YOU','PLEASE','SORRY','YES','NO',
  'HELP','WATER','FOOD','MORE','STOP',
  'GOOD','BAD','MY NAME IS','HOW ARE YOU'
];
const MOTION_TARGET = 150;
let SEQ_FRAMES = 30;

// ══════════════════════════════════════════════════════════
// MEDIAPIPE STATE
// ══════════════════════════════════════════════════════════

let handLandmarker  = null;
let lastVideoTime   = -1;
let currentLandmarks = null;   // exposed to capture functions

// ══════════════════════════════════════════════════════════
// STATIC CAPTURE STATE
// ══════════════════════════════════════════════════════════

let activeStaticSign = 'A';
let staticCaptures   = [];   // [{ label, landmarks:[63] }]
let staticRecentLog  = [];

// ══════════════════════════════════════════════════════════
// MOTION CAPTURE STATE
// ══════════════════════════════════════════════════════════

let activeMotionSign = 'HELLO';
let motionCaptures   = [];   // [{ label, sequence:[[63],...] }]
let motionRecentLog  = [];
let isRecording      = false;
let recordBuffer     = [];

// ══════════════════════════════════════════════════════════
// INIT
// ══════════════════════════════════════════════════════════

async function init() {
  try {
    setStatus('Requesting webcam…', '');
    const stream = await navigator.mediaDevices.getUserMedia({
      video: { width: { ideal: 1280 }, height: { ideal: 720 }, facingMode: 'user' },
      audio: false
    });

    const vStatic = document.getElementById('webcam-static');
    const vMotion = document.getElementById('webcam-motion');
    [vStatic, vMotion].forEach(v => { v.srcObject = stream; });

    await new Promise(r => { vStatic.onloadedmetadata = () => vStatic.play().then(r); });
    vMotion.play();

    const cStatic = document.getElementById('canvas-static');
    const cMotion = document.getElementById('canvas-motion');
    [cStatic, cMotion].forEach(c => {
      c.width  = vStatic.videoWidth;
      c.height = vStatic.videoHeight;
    });

    setStatus('Loading MediaPipe HandLandmarker model…', '');
    const vision = await FilesetResolver.forVisionTasks(
      'https://cdn.jsdelivr.net/npm/@mediapipe/tasks-vision@0.10.3/wasm'
    );
    handLandmarker = await HandLandmarker.createFromOptions(vision, {
      baseOptions: {
        modelAssetPath: 'https://storage.googleapis.com/mediapipe-models/hand_landmarker/hand_landmarker/float16/1/hand_landmarker.task',
        delegate: 'GPU'
      },
      runningMode: 'VIDEO',
      numHands: 2,
      minHandDetectionConfidence: 0.7,
      minHandPresenceConfidence:  0.7,
      minTrackingConfidence:      0.6,
    });

    setStatus('✅ Ready — show your hand', 'ok');

    buildStaticProgressGrid();
    buildMotionProgressGrid();

    requestAnimationFrame(loop);

  } catch(e) {
    setStatus('❌ ' + e.message, 'err');
    console.error(e);
  }
}

function setStatus(msg, cls) {
  const el = document.getElementById('status-bar');
  el.textContent = msg;
  el.className = 'status-bar' + (cls ? ' ' + cls : '');
}

// ══════════════════════════════════════════════════════════
// MAIN LOOP
// ══════════════════════════════════════════════════════════

function loop() {
  if (!handLandmarker) { requestAnimationFrame(loop); return; }

  const v = document.getElementById('webcam-static');
  if (v.currentTime !== lastVideoTime) {
    lastVideoTime = v.currentTime;
    const result  = handLandmarker.detectForVideo(v, performance.now());

    const lms = result.landmarks  ?? [];
    const hdns = result.handedness ?? [];

    const cStatic = document.getElementById('canvas-static');
    const cMotion = document.getElementById('canvas-motion');

    if (lms.length > 0) {
      // Draw skeleton on whichever canvas is visible
      [cStatic, cMotion].forEach(c => {
        const ctx = c.getContext('2d');
        ctx.clearRect(0, 0, c.width, c.height);
        lms.forEach(lm => drawSkeleton(ctx, lm, c.width, c.height));
      });

      currentLandmarks = pickDominantHand(lms, hdns);
      document.getElementById('hand-status').textContent =
        lms.length + ' hand' + (lms.length > 1 ? 's' : '') + ' detected';

      // Feed motion recording
      if (isRecording && currentLandmarks) {
        const flat = currentLandmarks.flatMap(p => [p.x, p.y, p.z]);
        recordBuffer.push(flat);
        updateRecordingProgressUI();
        if (recordBuffer.length >= SEQ_FRAMES) {
          finishRecording();
        }
      }

    } else {
      currentLandmarks = null;
      [cStatic, cMotion].forEach(c => {
        c.getContext('2d').clearRect(0, 0, c.width, c.height);
      });
      document.getElementById('hand-status').textContent = 'No hand detected';
    }
  }

  requestAnimationFrame(loop);
}

function pickDominantHand(landmarks, handedness) {
  if (!landmarks || landmarks.length === 0) return null;
  if (landmarks.length === 1) return landmarks[0];
  for (let i = 0; i < (handedness || []).length; i++) {
    const cat = (handedness[i]?.[0]?.categoryName) || '';
    if (cat === 'Left') return landmarks[i]; // mirrored: "Left" = user's right hand
  }
  return landmarks[0];
}

// ══════════════════════════════════════════════════════════
// TAB SWITCHING
// ══════════════════════════════════════════════════════════

window.switchTab = function(name) {
  document.querySelectorAll('.tab-btn').forEach(b => {
    b.classList.toggle('active', b.dataset.tab === name);
  });
  document.querySelectorAll('.tab-panel').forEach(p => {
    p.classList.toggle('active', p.id === 'panel-' + name);
  });
};

// ══════════════════════════════════════════════════════════
// STATIC CAPTURE — TAB 1
// ══════════════════════════════════════════════════════════

function buildStaticProgressGrid() {
  const grid = document.getElementById('static-progress-grid');
  grid.innerHTML = '';
  STATIC_SIGNS.forEach(sign => {
    const cell = document.createElement('div');
    cell.className = 'sp-cell' + (sign === activeStaticSign ? ' active-sign' : '');
    cell.id = 'sp-cell-' + sign;
    cell.onclick = e => {
      if (e.target.classList.contains('sp-del')) return;
      setActiveStaticSign(sign);
    };

    const delBtn = document.createElement('button');
    delBtn.className = 'sp-del';
    delBtn.title = 'Delete captures for ' + sign;
    delBtn.textContent = '✕';
    delBtn.onclick = e => { e.stopPropagation(); deleteStaticCapture(sign); };

    cell.innerHTML = `
      <div class="sp-letter">${sign}</div>
      <div class="sp-count" id="sp-count-${sign}">0 / ${STATIC_TARGET}</div>
      <div class="sp-bar"><div class="sp-fill" id="sp-fill-${sign}" style="width:0%"></div></div>`;
    cell.appendChild(delBtn);
    grid.appendChild(cell);
  });
  updateStaticCountTable();
}

function setActiveStaticSign(sign) {
  activeStaticSign = sign;
  document.querySelectorAll('#static-progress-grid .sp-cell').forEach(c => c.classList.remove('active-sign'));
  const cell = document.getElementById('sp-cell-' + sign);
  if (cell) cell.classList.add('active-sign');
  document.getElementById('active-sign-display').textContent = sign;
  updateActiveStaticStrip();
}

function countStatic(sign) {
  return staticCaptures.filter(c => c.label === sign).length;
}

function updateActiveStaticStrip() {
  const n = countStatic(activeStaticSign);
  document.getElementById('active-sign-strip').textContent = `${activeStaticSign}: ${n} / ${STATIC_TARGET}`;
}

function updateStaticCell(sign) {
  const n = countStatic(sign);
  const countEl = document.getElementById('sp-count-' + sign);
  const fillEl  = document.getElementById('sp-fill-'  + sign);
  const cell    = document.getElementById('sp-cell-'  + sign);
  if (countEl) countEl.textContent = `${n} / ${STATIC_TARGET}`;
  if (fillEl)  fillEl.style.width  = Math.min(100, Math.round((n / STATIC_TARGET) * 100)) + '%';
  if (cell) {
    cell.classList.toggle('done', n >= STATIC_TARGET);
  }
}

function updateStaticCountTable() {
  const tbl = document.getElementById('static-count-table');
  tbl.innerHTML = STATIC_SIGNS.map(sign => {
    const n = countStatic(sign);
    const done  = n >= STATIC_TARGET;
    const color = done ? 'var(--green)' : n > 0 ? 'var(--amber)' : 'var(--muted)';
    return `<div class="ct-row">
      <span style="color:${done ? 'var(--green)' : 'var(--muted)'}">${sign}</span>
      <span style="color:${color};font-weight:700">${n}</span>
    </div>`;
  }).join('');
}

function flashScreen(color) {
  const el = document.getElementById('capture-flash');
  el.style.background = color || 'var(--green)';
  el.className = 'capture-flash';
  void el.offsetWidth;
  el.classList.add('flash');
  setTimeout(() => el.className = 'capture-flash', 120);
}

function flashCell(id) {
  const cell = document.getElementById(id);
  if (!cell) return;
  cell.classList.remove('flash');
  void cell.offsetWidth;
  cell.classList.add('flash');
  setTimeout(() => cell.classList.remove('flash'), 280);
}

function addStaticMiniLog(sign, total) {
  const t = new Date();
  const ts = `${t.getHours().toString().padStart(2,'0')}:${t.getMinutes().toString().padStart(2,'0')}:${t.getSeconds().toString().padStart(2,'0')}`;
  staticRecentLog.unshift({ sign, ts, total });
  if (staticRecentLog.length > 40) staticRecentLog.pop();
  document.getElementById('static-mini-log').innerHTML = staticRecentLog.map(e =>
    `<div class="ml-entry">
      <span class="ml-sign-badge">${e.sign}</span>
      <span style="color:var(--muted)">#${e.total}</span>
      <span class="ml-ts">${e.ts}</span>
    </div>`
  ).join('');
}

window.captureStatic = function() {
  const lm = currentLandmarks;
  if (!lm || lm.length !== 21) {
    const btn = document.getElementById('btn-static-capture');
    const orig = btn.innerHTML;
    btn.innerHTML = '⚠️ &nbsp;No hand detected!';
    btn.style.borderColor = 'var(--red)';
    btn.style.color = 'var(--red)';
    setTimeout(() => {
      btn.innerHTML = orig;
      btn.style.borderColor = '';
      btn.style.color = '';
    }, 900);
    return;
  }

  const flat = lm.flatMap(p => [p.x, p.y, p.z]);
  staticCaptures.push({ label: activeStaticSign, landmarks: flat });

  const total = staticCaptures.length;
  document.getElementById('static-total-count').textContent = total;
  updateStaticCell(activeStaticSign);
  updateActiveStaticStrip();
  updateStaticCountTable();
  flashScreen('var(--green)');
  flashCell('sp-cell-' + activeStaticSign);
  addStaticMiniLog(activeStaticSign, total);

  // Auto-advance when target reached
  const n = countStatic(activeStaticSign);
  if (n === STATIC_TARGET) {
    const idx = STATIC_SIGNS.indexOf(activeStaticSign);
    if (idx < STATIC_SIGNS.length - 1) {
      setTimeout(() => setActiveStaticSign(STATIC_SIGNS[idx + 1]), 400);
    }
  }
};

function deleteStaticCapture(sign) {
  const current = countStatic(sign);
  if (current === 0) { alert(`No captures for "${sign}" to delete.`); return; }
  const input = prompt(
    `Delete captures for "${sign}".\nCurrently: ${current}\nHow many to delete? (1–${current})`, '1'
  );
  if (input === null) return;
  const n = parseInt(input);
  if (isNaN(n) || n < 1 || n > current) { alert(`Enter a number between 1 and ${current}.`); return; }

  let removed = 0;
  for (let i = staticCaptures.length - 1; i >= 0 && removed < n; i--) {
    if (staticCaptures[i].label === sign) { staticCaptures.splice(i, 1); removed++; }
  }

  document.getElementById('static-total-count').textContent = staticCaptures.length;
  updateStaticCell(sign);
  updateActiveStaticStrip();
  updateStaticCountTable();

  staticRecentLog.unshift({ sign: `−${n}×${sign}`, ts: 'deleted', total: staticCaptures.length });
  if (staticRecentLog.length > 40) staticRecentLog.pop();
  document.getElementById('static-mini-log').innerHTML = staticRecentLog.map(e =>
    `<div class="ml-entry">
      <span class="ml-sign-badge" style="color:var(--red)">${e.sign}</span>
      <span style="color:var(--muted)">${e.total}</span>
      <span class="ml-ts">${e.ts}</span>
    </div>`
  ).join('');
}

window.exportStaticJSON = function() {
  if (staticCaptures.length === 0) { alert('No captures yet.'); return; }
  const blob = new Blob([JSON.stringify(staticCaptures, null, 2)], { type: 'application/json' });
  const a = document.createElement('a');
  a.href = URL.createObjectURL(blob);
  a.download = 'static_data.json';
  a.click();
  URL.revokeObjectURL(a.href);
};

window.clearStaticData = function() {
  if (!confirm(`Clear all ${staticCaptures.length} captures? This cannot be undone.`)) return;
  staticCaptures  = [];
  staticRecentLog = [];
  document.getElementById('static-total-count').textContent = '0';
  document.getElementById('static-mini-log').innerHTML = 'No captures yet — show your hand and press Space…';
  STATIC_SIGNS.forEach(s => updateStaticCell(s));
  updateActiveStaticStrip();
  updateStaticCountTable();
};

// ══════════════════════════════════════════════════════════
// MOTION CAPTURE — TAB 2
// ══════════════════════════════════════════════════════════

function buildMotionProgressGrid() {
  const grid = document.getElementById('motion-progress-grid');
  grid.innerHTML = '';
  MOTION_SIGNS.forEach(sign => {
    const cell = document.createElement('div');
    cell.className = 'sp-cell' + (sign === activeMotionSign ? ' active-sign' : '');
    cell.id = 'mp-cell-' + sign;
    if (sign === activeMotionSign) cell.style.borderColor = 'var(--purple)';
    cell.onclick = e => {
      if (e.target.classList.contains('sp-del')) return;
      setActiveMotionSign(sign);
    };

    const delBtn = document.createElement('button');
    delBtn.className = 'sp-del';
    delBtn.title = 'Delete sequences for ' + sign;
    delBtn.textContent = '✕';
    delBtn.onclick = e => { e.stopPropagation(); deleteMotionCapture(sign); };

    cell.innerHTML = `
      <div class="sp-letter" style="font-size:10px;word-break:break-word;line-height:1.2">${sign}</div>
      <div class="sp-count" id="mp-count-${sign}">0 / ${MOTION_TARGET}</div>
      <div class="sp-bar"><div class="sp-fill" id="mp-fill-${sign}" style="width:0%;background:var(--purple)"></div></div>`;
    cell.appendChild(delBtn);
    grid.appendChild(cell);
  });
  updateMotionCountTable();
}

function setActiveMotionSign(sign) {
  activeMotionSign = sign;
  document.querySelectorAll('#motion-progress-grid .sp-cell').forEach(c => {
    c.classList.remove('active-sign');
    c.style.borderColor = '';
  });
  const cell = document.getElementById('mp-cell-' + sign);
  if (cell) { cell.classList.add('active-sign'); cell.style.borderColor = 'var(--purple)'; }
  document.getElementById('active-motion-display').textContent = sign;
  updateActiveMotionStrip();
}

function countMotion(sign) {
  return motionCaptures.filter(c => c.label === sign).length;
}

function updateActiveMotionStrip() {
  const n = countMotion(activeMotionSign);
  document.getElementById('active-motion-strip').textContent = `${activeMotionSign}: ${n} / ${MOTION_TARGET}`;
}

function updateMotionCell(sign) {
  const n = countMotion(sign);
  const countEl = document.getElementById('mp-count-' + sign);
  const fillEl  = document.getElementById('mp-fill-'  + sign);
  const cell    = document.getElementById('mp-cell-'  + sign);
  if (countEl) countEl.textContent = `${n} / ${MOTION_TARGET}`;
  if (fillEl)  fillEl.style.width  = Math.min(100, Math.round((n / MOTION_TARGET) * 100)) + '%';
  if (cell) cell.classList.toggle('done', n >= MOTION_TARGET);
}

function updateMotionCountTable() {
  const tbl = document.getElementById('motion-count-table');
  tbl.innerHTML = MOTION_SIGNS.map(sign => {
    const n = countMotion(sign);
    const done  = n >= MOTION_TARGET;
    const color = done ? 'var(--purple)' : n > 0 ? 'var(--amber)' : 'var(--muted)';
    return `<div class="ct-row">
      <span style="color:${done ? 'var(--purple)' : 'var(--muted)'}">${sign}</span>
      <span style="color:${color};font-weight:700">${n}</span>
    </div>`;
  }).join('');
}

function updateRecordingProgressUI() {
  const n   = recordBuffer.length;
  const pct = Math.min(100, Math.round((n / SEQ_FRAMES) * 100));
  document.getElementById('rec-frame-count').textContent = n;
  document.getElementById('seq-bar').style.width = pct + '%';
  document.getElementById('rec-progress-wrap').style.display = 'block';
}

function finishRecording() {
  isRecording = false;
  const sequence = [...recordBuffer];
  recordBuffer = [];
  motionCaptures.push({ label: activeMotionSign, sequence });

  const total = motionCaptures.length;
  document.getElementById('motion-total-count').textContent = total;
  updateMotionCell(activeMotionSign);
  updateActiveMotionStrip();
  updateMotionCountTable();

  const btn = document.getElementById('btn-motion-record');
  btn.classList.remove('recording');
  btn.innerHTML = '🎬 &nbsp;RECORD &nbsp;<span class="kbd">R</span>';
  document.getElementById('rec-progress-wrap').style.display = 'none';
  document.getElementById('seq-bar').style.width = '0%';

  flashScreen('var(--purple)');

  const t = new Date();
  const ts = `${t.getHours().toString().padStart(2,'0')}:${t.getMinutes().toString().padStart(2,'0')}:${t.getSeconds().toString().padStart(2,'0')}`;
  motionRecentLog.unshift({ sign: activeMotionSign, ts, total });
  if (motionRecentLog.length > 40) motionRecentLog.pop();
  document.getElementById('motion-mini-log').innerHTML = motionRecentLog.map(e =>
    `<div class="ml-entry">
      <span class="ml-sign-badge" style="color:var(--purple)">${e.sign}</span>
      <span style="color:var(--muted)">#${e.total}</span>
      <span class="ml-ts">${e.ts}</span>
    </div>`
  ).join('');

  // Auto-advance
  const n = countMotion(activeMotionSign);
  if (n === MOTION_TARGET) {
    const idx = MOTION_SIGNS.indexOf(activeMotionSign);
    if (idx < MOTION_SIGNS.length - 1) {
      setTimeout(() => setActiveMotionSign(MOTION_SIGNS[idx + 1]), 500);
    }
  }
}

window.recordMotion = function() {
  if (isRecording) {
    // Cancel
    isRecording  = false;
    recordBuffer = [];
    const btn = document.getElementById('btn-motion-record');
    btn.classList.remove('recording');
    btn.innerHTML = '🎬 &nbsp;RECORD &nbsp;<span class="kbd">R</span>';
    document.getElementById('rec-progress-wrap').style.display = 'none';
    document.getElementById('seq-bar').style.width = '0%';
    return;
  }

  isRecording  = true;
  recordBuffer = [];
  const btn = document.getElementById('btn-motion-record');
  btn.classList.add('recording');
  btn.innerHTML = '⏹ &nbsp;STOP RECORDING &nbsp;<span class="kbd">R</span>';
  document.getElementById('rec-target-frames').textContent = SEQ_FRAMES;
  document.getElementById('rec-frame-count').textContent = '0';
  document.getElementById('seq-bar').style.width = '0%';
  document.getElementById('rec-progress-wrap').style.display = 'block';
};

function deleteMotionCapture(sign) {
  const current = countMotion(sign);
  if (current === 0) { alert(`No sequences for "${sign}" to delete.`); return; }
  const input = prompt(
    `Delete sequences for "${sign}".\nCurrently: ${current}\nHow many to delete? (1–${current})`, '1'
  );
  if (input === null) return;
  const n = parseInt(input);
  if (isNaN(n) || n < 1 || n > current) { alert(`Enter a number between 1 and ${current}.`); return; }

  let removed = 0;
  for (let i = motionCaptures.length - 1; i >= 0 && removed < n; i--) {
    if (motionCaptures[i].label === sign) { motionCaptures.splice(i, 1); removed++; }
  }

  document.getElementById('motion-total-count').textContent = motionCaptures.length;
  updateMotionCell(sign);
  updateActiveMotionStrip();
  updateMotionCountTable();

  motionRecentLog.unshift({ sign: `−${n}×${sign}`, ts: 'deleted', total: motionCaptures.length });
  if (motionRecentLog.length > 40) motionRecentLog.pop();
  document.getElementById('motion-mini-log').innerHTML = motionRecentLog.map(e =>
    `<div class="ml-entry">
      <span class="ml-sign-badge" style="color:var(--red)">${e.sign}</span>
      <span style="color:var(--muted)">${e.total}</span>
      <span class="ml-ts">${e.ts}</span>
    </div>`
  ).join('');
}

window.exportMotionJSON = function() {
  if (motionCaptures.length === 0) { alert('No sequences yet.'); return; }
  const blob = new Blob([JSON.stringify(motionCaptures, null, 2)], { type: 'application/json' });
  const a = document.createElement('a');
  a.href = URL.createObjectURL(blob);
  a.download = 'sequence_data.json';
  a.click();
  URL.revokeObjectURL(a.href);
};

window.clearMotionData = function() {
  if (!confirm(`Clear all ${motionCaptures.length} sequences? This cannot be undone.`)) return;
  motionCaptures  = [];
  motionRecentLog = [];
  document.getElementById('motion-total-count').textContent = '0';
  document.getElementById('motion-mini-log').innerHTML = 'No sequences yet — press R to record…';
  MOTION_SIGNS.forEach(s => updateMotionCell(s));
  updateActiveMotionStrip();
  updateMotionCountTable();
};

window.updateFrameTarget = function(v) {
  SEQ_FRAMES = parseInt(v);
  document.getElementById('frames-val').textContent = v;
  document.getElementById('rec-target-frames').textContent = v;
};

// ══════════════════════════════════════════════════════════
// KEYBOARD SHORTCUTS
// ══════════════════════════════════════════════════════════

window.addEventListener('keydown', e => {
  const tag = document.activeElement.tagName;
  if (tag === 'INPUT' || tag === 'TEXTAREA') return;

  const staticActive = document.getElementById('panel-static').classList.contains('active');
  const motionActive = document.getElementById('panel-motion').classList.contains('active');

  if (e.code === 'Space' && staticActive) {
    e.preventDefault();
    window.captureStatic();
  }

  if (e.code === 'KeyR' && motionActive) {
    e.preventDefault();
    window.recordMotion();
  }

  if (staticActive) {
    if (e.code === 'ArrowRight' || e.code === 'ArrowDown') {
      const idx = STATIC_SIGNS.indexOf(activeStaticSign);
      if (idx < STATIC_SIGNS.length - 1) setActiveStaticSign(STATIC_SIGNS[idx + 1]);
    }
    if (e.code === 'ArrowLeft' || e.code === 'ArrowUp') {
      const idx = STATIC_SIGNS.indexOf(activeStaticSign);
      if (idx > 0) setActiveStaticSign(STATIC_SIGNS[idx - 1]);
    }
  }

  if (motionActive) {
    if (e.code === 'ArrowRight' || e.code === 'ArrowDown') {
      const idx = MOTION_SIGNS.indexOf(activeMotionSign);
      if (idx < MOTION_SIGNS.length - 1) setActiveMotionSign(MOTION_SIGNS[idx + 1]);
    }
    if (e.code === 'ArrowLeft' || e.code === 'ArrowUp') {
      const idx = MOTION_SIGNS.indexOf(activeMotionSign);
      if (idx > 0) setActiveMotionSign(MOTION_SIGNS[idx - 1]);
    }
  }
});

// ══════════════════════════════════════════════════════════
// SKELETON DRAWING
// ══════════════════════════════════════════════════════════

const CONN = [
  [0,1],[1,2],[2,3],[3,4],
  [0,5],[5,6],[6,7],[7,8],
  [0,9],[9,10],[10,11],[11,12],
  [0,13],[13,14],[14,15],[15,16],
  [0,17],[17,18],[18,19],[19,20],
  [5,9],[9,13],[13,17]
];

function drawSkeleton(ctx, lm, w, h) {
  ctx.strokeStyle = '#FFFFFF55';
  ctx.lineWidth = 1.5;
  for (const [a, b] of CONN) {
    ctx.beginPath();
    ctx.moveTo(lm[a].x * w, lm[a].y * h);
    ctx.lineTo(lm[b].x * w, lm[b].y * h);
    ctx.stroke();
  }
  for (let i = 0; i < 21; i++) {
    const tip = [4, 8, 12, 16, 20].includes(i);
    ctx.beginPath();
    ctx.arc(lm[i].x * w, lm[i].y * h, tip ? 6 : 3.5, 0, Math.PI * 2);
    ctx.fillStyle = tip ? '#FFFFFF' : '#00e5a0';
    ctx.fill();
  }
}

// ══════════════════════════════════════════════════════════
// BOOT
// ══════════════════════════════════════════════════════════

init();
</file>

<file path="m2-capture.html">
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>M2 Capture — Static & Motion Data Collection</title>
<style>
  @import url('https://fonts.googleapis.com/css2?family=JetBrains+Mono:wght@400;700;800&family=Space+Grotesk:wght@400;500;700&display=swap');

  :root {
    --bg:       #0a0e17;
    --surface:  #111827;
    --surface2: #1a2235;
    --border:   #1f2d3d;
    --text:     #e2e8f0;
    --muted:    #4a5568;
    --green:    #00e5a0;
    --amber:    #f5a623;
    --red:      #ff5f6d;
    --purple:   #a78bfa;
    --blue:     #60a5fa;
    --font:     'JetBrains Mono', monospace;
  }

  *, *::before, *::after { box-sizing: border-box; margin: 0; padding: 0; }

  body {
    font-family: var(--font);
    background: var(--bg);
    color: var(--text);
    min-height: 100vh;
    padding: 16px;
  }

  /* ── HEADER ── */
  .page-header {
    text-align: center;
    padding: 12px 0 18px;
    border-bottom: 1px solid var(--border);
    margin-bottom: 16px;
  }
  .page-header h1 {
    font-size: 18px;
    font-weight: 800;
    letter-spacing: .04em;
    color: var(--green);
  }
  .page-header .sub {
    font-size: 11px;
    color: var(--muted);
    margin-top: 4px;
  }
  .page-header .hand-status {
    font-size: 12px;
    color: var(--green);
    margin-top: 6px;
    min-height: 18px;
  }

  /* ── STATUS BAR ── */
  .status-bar {
    text-align: center;
    font-size: 11px;
    padding: 6px 12px;
    border-radius: 6px;
    border: 1px solid var(--border);
    background: var(--surface2);
    margin-bottom: 14px;
    color: var(--muted);
  }
  .status-bar.ok  { color: var(--green); border-color: #00e5a033; }
  .status-bar.err { color: var(--red);   border-color: #ff5f6d33; }

  /* ── TABS ── */
  .tabs {
    display: flex;
    gap: 6px;
    margin-bottom: 14px;
    border-bottom: 1px solid var(--border);
    padding-bottom: 10px;
  }
  .tab-btn {
    padding: 7px 18px;
    font-family: var(--font);
    font-size: 12px;
    font-weight: 700;
    border-radius: 6px;
    border: 1px solid var(--border);
    background: var(--surface2);
    color: var(--muted);
    cursor: pointer;
    transition: all .15s;
    letter-spacing: .02em;
  }
  .tab-btn:hover { color: var(--text); border-color: var(--muted); }
  .tab-btn.active {
    background: #00e5a015;
    border-color: var(--green);
    color: var(--green);
  }
  .tab-btn.motion-tab.active {
    background: #a78bfa15;
    border-color: var(--purple);
    color: var(--purple);
  }
  .tab-panel { display: none; }
  .tab-panel.active { display: flex; gap: 14px; flex-wrap: wrap; align-items: flex-start; }

  /* ── LAYOUT ── */
  .col { display: flex; flex-direction: column; gap: 10px; }
  .card {
    background: var(--surface);
    border: 1px solid var(--border);
    border-radius: 8px;
    padding: 12px;
  }
  .ctitle {
    font-size: 10px;
    font-weight: 700;
    color: var(--muted);
    letter-spacing: .08em;
    text-transform: uppercase;
    margin-bottom: 8px;
  }

  /* ── WEBCAM ── */
  .webcam-wrap {
    position: relative;
    border-radius: 10px;
    overflow: hidden;
    background: #000;
    border: 1px solid var(--border);
    aspect-ratio: 16/9;
  }
  .webcam-wrap video,
  .webcam-wrap canvas {
    position: absolute; inset: 0;
    width: 100%; height: 100%;
    object-fit: cover;
    transform: scaleX(-1);
  }
  .webcam-wrap canvas { background: transparent; }

  /* ── BIG BUTTONS ── */
  .big-btn {
    width: 100%;
    padding: 18px;
    font-family: var(--font);
    font-size: 16px;
    font-weight: 900;
    letter-spacing: .05em;
    border-radius: 8px;
    border: 2px solid var(--green);
    background: #00e5a015;
    color: var(--green);
    cursor: pointer;
    transition: all .15s;
    text-transform: uppercase;
  }
  .big-btn:hover   { background: #00e5a030; }
  .big-btn:active  { background: #00e5a050; transform: scale(.98); }
  .big-btn:disabled{ opacity: .4; cursor: not-allowed; }
  .big-btn.purple  { border-color: var(--purple); background: #a78bfa15; color: var(--purple); }
  .big-btn.purple:hover  { background: #a78bfa28; }
  .big-btn.recording {
    border-color: var(--red);
    background: #ff5f6d18;
    color: var(--red);
    animation: recordPulse .6s infinite alternate;
  }
  @keyframes recordPulse { from { background: #ff5f6d18; } to { background: #ff5f6d33; } }

  .btn-row { display: flex; gap: 8px; }
  .btn {
    padding: 8px 16px;
    font-family: var(--font);
    font-size: 11px;
    font-weight: 700;
    border-radius: 6px;
    border: 1px solid var(--green);
    background: #00e5a015;
    color: var(--green);
    cursor: pointer;
    transition: all .15s;
    flex: 1;
  }
  .btn:hover { background: #00e5a030; }
  .btn.red   { border-color: var(--red);   background: #ff5f6d10; color: var(--red); }
  .btn.red:hover   { background: #ff5f6d25; }
  .btn.purple { border-color: var(--purple); background: #a78bfa10; color: var(--purple); }
  .btn.purple:hover { background: #a78bfa25; }

  .kbd {
    display: inline-block;
    padding: 2px 6px;
    background: var(--surface2);
    border: 1px solid var(--border);
    border-radius: 4px;
    font-size: 10px;
    color: var(--muted);
  }

  /* ── TOTALS STRIP ── */
  .totals-strip {
    display: flex;
    align-items: center;
    justify-content: space-between;
    background: var(--surface2);
    border: 1px solid var(--border);
    border-radius: 8px;
    padding: 10px 14px;
  }
  .totals-big  { font-size: 32px; font-weight: 900; color: var(--green); line-height: 1; }
  .totals-big.purple { color: var(--purple); }
  .totals-label{ font-size: 10px; color: var(--muted); margin-top: 3px; }
  .totals-right { text-align: right; font-size: 12px; font-weight: 700; color: var(--amber); }
  .totals-sub   { font-size: 10px; color: var(--muted); margin-top: 2px; }

  /* ── ACTIVE SIGN DISPLAY ── */
  .active-sign-box {
    text-align: center;
    padding: 10px 0 6px;
  }
  .active-sign-label { font-size: 10px; color: var(--muted); }
  .active-sign-big   { font-size: 64px; font-weight: 900; color: var(--green); line-height: 1.1; letter-spacing: .04em; }
  .active-sign-big.purple { color: var(--purple); font-size: 36px; }
  .active-sign-hint  { font-size: 10px; color: var(--muted); margin-top: 4px; }

  /* ── PROGRESS GRID ── */
  .sign-progress-grid {
    display: grid;
    grid-template-columns: repeat(auto-fill, minmax(68px, 1fr));
    gap: 5px;
  }
  .sp-cell {
    background: var(--surface2);
    border: 1px solid var(--border);
    border-radius: 6px;
    padding: 6px 4px;
    text-align: center;
    cursor: pointer;
    transition: all .15s;
    position: relative;
  }
  .sp-cell:hover       { border-color: var(--green); }
  .sp-cell.active-sign { border-color: var(--green); background: #00e5a015; }
  .sp-cell.active-sign.purple-active { border-color: var(--purple); background: #a78bfa10; }
  .sp-cell.done        { border-color: #00e5a040; }
  .sp-cell .sp-letter  { font-size: 14px; font-weight: 900; color: var(--text); line-height: 1; }
  .sp-cell .sp-count   { font-size: 9px; color: var(--muted); margin-top: 3px; }
  .sp-cell .sp-bar     { height: 3px; border-radius: 99px; background: var(--border); margin-top: 4px; overflow: hidden; }
  .sp-cell .sp-fill    { height: 100%; border-radius: 99px; background: var(--green); transition: width .2s; }
  .sp-cell.done .sp-letter { color: var(--green); }
  .sp-cell.done .sp-count  { color: var(--green); }

  /* motion variant */
  .sp-cell .sp-fill.purple { background: var(--purple); }
  .sp-cell:hover.motion-cell { border-color: var(--purple); }

  .sp-del {
    position: absolute; top: 2px; right: 3px;
    font-size: 8px; line-height: 1;
    background: none; border: none;
    color: var(--muted); cursor: pointer;
    padding: 1px 2px; border-radius: 2px;
    transition: color .1s;
    display: none;
  }
  .sp-cell:hover .sp-del { display: block; }
  .sp-del:hover { color: var(--red) !important; }

  @keyframes flashCapture { 0% { background: #00e5a033; } 100% { background: #00e5a015; } }
  .sp-cell.flash { animation: flashCapture .25s ease-out; }

  /* ── COUNT TABLE ── */
  .count-table-grid { display: grid; grid-template-columns: 1fr 1fr; gap: 2px 16px; }
  .ct-row {
    display: flex; justify-content: space-between;
    padding: 2px 0; border-bottom: 1px solid #1f273333;
    font-size: 11px;
  }

  /* ── MINI LOG ── */
  .mini-log {
    height: 130px; overflow-y: auto;
    font-size: 10px; line-height: 1.9;
    background: var(--surface2);
    border: 1px solid var(--border);
    border-radius: 6px;
    padding: 8px;
  }
  .mini-log::-webkit-scrollbar { width: 3px; }
  .mini-log::-webkit-scrollbar-thumb { background: var(--border); border-radius: 99px; }
  .ml-entry { color: var(--muted); display: flex; gap: 8px; }
  .ml-sign-badge { color: var(--green); font-weight: 900; min-width: 32px; }
  .ml-sign-badge.purple { color: var(--purple); }
  .ml-ts { color: #2a3544; font-size: 9px; }

  /* ── RECORDING PROGRESS BAR ── */
  .rec-progress-wrap {
    display: none;
    margin-bottom: 4px;
  }
  .rec-label {
    font-size: 11px; color: var(--red); text-align: center; margin-bottom: 4px;
  }
  .seq-bar-outer { width: 100%; height: 10px; background: var(--surface2); border-radius: 99px; overflow: hidden; }
  .seq-bar-inner { height: 100%; border-radius: 99px; background: var(--red); transition: width .05s; width: 0%; }

  /* ── SETTINGS ── */
  .setting-row {
    display: flex; align-items: center; gap: 8px;
    font-size: 11px; color: var(--muted); margin-bottom: 6px;
  }
  .setting-row input[type=range] { flex: 1; accent-color: var(--green); }
  .setting-val { color: var(--amber); font-weight: 700; min-width: 40px; }

  /* ── INSTRUCTIONS BOX ── */
  .instr {
    font-size: 11px; color: var(--muted); line-height: 1.7;
    background: var(--surface2); border: 1px solid var(--border);
    border-radius: 6px; padding: 12px;
  }
  .instr b { color: var(--amber); }

  /* ── SCREEN FLASH ── */
  .capture-flash {
    position: fixed; inset: 0; pointer-events: none;
    background: var(--green); opacity: 0; z-index: 9999;
    transition: opacity .05s;
  }
  .capture-flash.flash { opacity: .08; }
  .capture-flash.rec-flash { background: var(--red); opacity: .12; }
</style>
</head>
<body>

<div class="capture-flash" id="capture-flash"></div>

<div class="page-header">
  <h1>📸 M2 Capture Tool — Static & Motion Training Data</h1>
  <div class="sub">Tab 1: Static signs (A–Z + ILY) &nbsp;|&nbsp; Tab 2: Motion signs (words/phrases)</div>
  <div class="hand-status" id="hand-status">Waiting for hands…</div>
</div>

<div class="status-bar" id="status-bar">Loading MediaPipe model…</div>

<div class="tabs">
  <button class="tab-btn active"      onclick="switchTab('static')">📸 Static Capture (A–Z)</button>
  <button class="tab-btn motion-tab"  onclick="switchTab('motion')">🎬 Motion Capture (Words)</button>
</div>

<!-- ═══════════════════════════════════════════════════════════ -->
<!-- TAB 1 — STATIC CAPTURE                                     -->
<!-- ═══════════════════════════════════════════════════════════ -->
<div class="tab-panel active" id="panel-static">

  <!-- LEFT: webcam + capture controls -->
  <div class="col" style="flex:2;min-width:340px">
    <div class="webcam-wrap">
      <video id="webcam-static" autoplay playsinline muted></video>
      <canvas id="canvas-static"></canvas>
    </div>

    <div class="active-sign-box">
      <div class="active-sign-label">Currently capturing</div>
      <div class="active-sign-big" id="active-sign-display">A</div>
      <div class="active-sign-hint">Click a letter below → then capture &nbsp;|&nbsp; ← → arrow keys to cycle</div>
    </div>

    <button class="big-btn" id="btn-static-capture" onclick="captureStatic()">
      📸 &nbsp;CAPTURE &nbsp;<span class="kbd">SPACE</span>
    </button>

    <div class="totals-strip">
      <div>
        <div class="totals-big" id="static-total-count">0</div>
        <div class="totals-label">total snapshots</div>
      </div>
      <div class="totals-right">
        <div id="active-sign-strip">A: 0 / 150</div>
        <div class="totals-sub">Goal: 150 per sign × 25 signs = 3,750</div>
      </div>
    </div>

    <div class="btn-row">
      <button class="btn" style="flex:2" onclick="exportStaticJSON()">⬇ Export static_data.json</button>
      <button class="btn red" style="flex:1" onclick="clearStaticData()">🗑 Clear all</button>
    </div>

    <div class="card">
      <div class="ctitle">Recent captures</div>
      <div class="mini-log" id="static-mini-log">No captures yet — show your hand and press Space…</div>
    </div>
  </div>

  <!-- RIGHT: grid + instructions -->
  <div class="col" style="flex:1.5;min-width:280px">

    <div class="instr">
      <b>HOW TO CAPTURE:</b><br><br>
      1. Click a letter in the grid to select it.<br>
      2. Hold that sign clearly in front of the camera.<br>
      3. Press <b>Space</b> (or the Capture button).<br>
      4. Repeat — aim for <b>150 per sign</b>.<br><br>
      <b>Variation tips (IMPORTANT):</b><br>
      &nbsp;• Move hand left / right / closer / farther<br>
      &nbsp;• Tilt wrist slightly each shot<br>
      &nbsp;• Don't always hold the same position<br><br>
      <b>J and Z are motion signs</b> — skip them here.<br>
      <b>ILY</b> = I Love You (thumb + index + pinky).<br><br>
      After all signs: click <b>Export</b>. Save file into <b>data/</b> folder.
    </div>

    <div class="card">
      <div class="ctitle">Sign progress — click to select &nbsp;|&nbsp; hover → ✕ delete</div>
      <div style="font-size:10px;color:var(--muted);margin-bottom:8px">
        Green border = selected &nbsp;|&nbsp; bar fills toward 150 target
      </div>
      <div class="sign-progress-grid" id="static-progress-grid"></div>
    </div>

    <div class="card">
      <div class="ctitle">Count per sign</div>
      <div class="count-table-grid" id="static-count-table"></div>
    </div>
  </div>
</div>

<!-- ═══════════════════════════════════════════════════════════ -->
<!-- TAB 2 — MOTION CAPTURE                                     -->
<!-- ═══════════════════════════════════════════════════════════ -->
<div class="tab-panel" id="panel-motion">

  <!-- LEFT: webcam + record controls -->
  <div class="col" style="flex:2;min-width:340px">
    <div class="webcam-wrap">
      <video id="webcam-motion" autoplay playsinline muted></video>
      <canvas id="canvas-motion"></canvas>
    </div>

    <div class="active-sign-box">
      <div class="active-sign-label">Currently capturing motion for</div>
      <div class="active-sign-big purple" id="active-motion-display">HELLO</div>
      <div class="active-sign-hint">Click a word in the grid → then record &nbsp;|&nbsp; ← → to cycle</div>
    </div>

    <!-- Recording progress -->
    <div class="rec-progress-wrap" id="rec-progress-wrap">
      <div class="rec-label">
        🔴 Recording… <span id="rec-frame-count">0</span> / <span id="rec-target-frames">30</span> frames
      </div>
      <div class="seq-bar-outer">
        <div class="seq-bar-inner" id="seq-bar"></div>
      </div>
    </div>

    <button class="big-btn purple" id="btn-motion-record" onclick="recordMotion()">
      🎬 &nbsp;RECORD &nbsp;<span class="kbd">R</span>
    </button>

